In [1]:
import pandas as pd

In [20]:
dr=pd.read_excel("./data/Taux d.xlsx")
dr

       Date  Taux d'occupation
0   01/2025                 44
1   02/2025                 50
2   03/2025                 40
3   04/2025                 57
4   05/2025                 54
..      ...                ...
61  08/2017                 55
62  09/2017                 46
63  10/2017                 48
64  11/2017                 45
65  12/2017                 39

[66 rows x 2 columns]

In [21]:
taux_2012=[32, 37 ,38, 46, 41, 41,42,42,46,41,38,34]
taux_2013=[35,38,43,48,46,46,35,54,50,44,41,39]
taux_2015=[34,39,41,47,45,33,35,55,42,43,37,33]
taux_2016=[32,35,39,44,42,26,43,55,42,41,42,36]

In [22]:
annees=[2012,2013,2015,2016]
annees.reverse()

In [23]:

taux_par_annee = {an: globals()[f"taux_{an}"] 
                 for an in annees 
                 if f"taux_{an}" in globals()}


nuits=[]
for i in range(len(annees)):
    for j in range(12):
        mois=f"0{j+1}" if j<9 else f"{j+1}"
        nuits.append({
            "Date":f"{mois}/{annees[i]}",
            "Taux d'occupation":taux_par_annee[annees[i]][j]
        })

In [25]:
tes=pd.DataFrame(nuits)

In [27]:
dtt=pd.concat([dr,tes],ignore_index=True)
dtt.to_csv("Taux_occupation.csv",index=False)

In [28]:
df1=pd.read_csv('./arrivee_touristiques.csv')
df2=pd.read_csv('./nuité.csv')
df3=pd.read_csv('./Taux_occupation.csv')

In [29]:
df1=df1.rename(columns={"date":"Date"})
df1

        Date       TES       MRE  Total Arrivées
0    01/2025  624848.0  640349.0         1265197
1    02/2025  761377.0  634800.0         1396177
2    03/2025  768739.0  583272.0         1352011
3    04/2025  966724.0  698077.0         1664801
4    05/2025       NaN       NaN          154004
..       ...       ...       ...             ...
169  08/2010  404345.0  474552.0          878897
170  09/2010  393909.0  276371.0          670280
171  10/2010  488256.0  252161.0          740417
172  11/2010  372583.0  322419.0          695002
173  12/2010  391648.0  311463.0          703111

[174 rows x 4 columns]

In [30]:
df1["Date"].unique().shape

(174,)

In [31]:
df2

        Date      Nuité
0    01/2025  1748788.0
1    02/2025  1797178.0
2    03/2025  1754640.0
3    04/2025  2463774.0
4    05/2025  2305539.0
..       ...        ...
157  08/2011  1315792.0
158  09/2011  1552365.0
159  10/2011  1503095.0
160  11/2011  1084808.0
161  12/2011  1116792.0

[162 rows x 2 columns]

In [32]:
df3

        Date  Taux d'occupation
0    01/2025                 44
1    02/2025                 50
2    03/2025                 40
3    04/2025                 57
4    05/2025                 54
..       ...                ...
109  08/2012                 42
110  09/2012                 46
111  10/2012                 41
112  11/2012                 38
113  12/2012                 34

[114 rows x 2 columns]

In [33]:
data=pd.merge(df1,df2,on='Date',how='outer')
data

        Date       TES       MRE  Total Arrivées      Nuité
0    01/2010  291608.0  216485.0          508093        NaN
1    01/2011  347822.0  238691.0          586513  1285171.0
2    01/2012  305247.0  227783.0          533030  1073849.0
3    01/2013  309813.0  240686.0          550499  1220383.0
4    01/2014  354493.0  248723.0          603216  1333413.0
..       ...       ...       ...             ...        ...
169  12/2019  574847.0  419377.0          994224  1767518.0
170  12/2021    3718.0    9565.0           13283   559906.0
171  12/2022  594992.0  558340.0         1153332  1755566.0
172  12/2023  636217.0  638475.0         1274692  1587377.0
173  12/2024  784192.0  753742.0         1537934  1950797.0

[174 rows x 5 columns]

In [37]:
all=pd.merge(data,df3,on="Date",how='outer')
all

        Date       TES       MRE  Total Arrivées      Nuité  Taux d'occupation
0    01/2010  291608.0  216485.0          508093        NaN                NaN
1    01/2011  347822.0  238691.0          586513  1285171.0                NaN
2    01/2012  305247.0  227783.0          533030  1073849.0               32.0
3    01/2013  309813.0  240686.0          550499  1220383.0               35.0
4    01/2014  354493.0  248723.0          603216  1333413.0                NaN
..       ...       ...       ...             ...        ...                ...
169  12/2019  574847.0  419377.0          994224  1767518.0                NaN
170  12/2021    3718.0    9565.0           13283   559906.0                NaN
171  12/2022  594992.0  558340.0         1153332  1755566.0               42.0
172  12/2023  636217.0  638475.0         1274692  1587377.0               42.0
173  12/2024  784192.0  753742.0         1537934  1950797.0               48.0

[174 rows x 6 columns]

In [39]:
all.to_csv("KPI_touristique.csv")